; domain
(define (domain blocks-world)
  (:requirements :strips :negative-preconditions :typing :existential-preconditions)
  
  (:types
    agent block location - object
  )
  
  (:predicates
    (ontable ?b - block)                           ; block is on the table
    (on ?b1 - block ?b2 - block)                   ; block1 is on block2
    (at ?b - block ?l - location)                  ; block is at location
    (clear ?b - block)                             ; block has nothing on top
    (available ?a - agent)                         ; agent is available
    (empty ?l - location)                          ; location has no block
    
    (moving-onblock-to-table ?a - agent ?b - block ?l1 - location ?l2 - location)
    (moving-onblock-to-block ?a - agent ?b1 - block ?b2 - block ?l1 - location ?l2 - location)
    (moving-table-to-table ?a - agent ?b - block ?l1 - location ?l2 - location)
    (moving-table-to-block ?a - agent ?b1 - block ?b2 - block ?l1 - location ?l2 - location)
  )

  (:action move-onblock-to-table-start
    :parameters (?a - agent ?b1 - block ?b2 - block ?l1 - location ?l2 - location)
    :precondition (and
      (available ?a)
      (on ?b1 ?b2)
      (at ?b1 ?l1)
      (at ?b2 ?l1)
      (clear ?b1)
      (empty ?l2)

      (not (exists (?b - block) (moving-onblock-to-table ?a ?b ?l1 ?l2)))
      ;(not (exists (?b3 - block) (moving-onblock-to-block ?a ?b1 ?b3 ?l1 ?l2)))
      ;(not (exists (?b3 - block) (moving-table-to-table ?a ?b3 ?l1 ?l2)))
      ;(not (exists (?b3 - block ?b4 - block) (moving-table-to-block ?a ?b3 ?b4 ?l1 ?l2)))
    )
    :effect (and
      (not (available ?a))
      (not (clear ?b1))
      (not (on ?b1 ?b2))
      (not (at ?b1 ?l1))
      (clear ?b2)
      (moving-onblock-to-table ?a ?b1 ?l1 ?l2)
    )
  )
  
  (:action move-onblock-to-table-end
    :parameters (?a - agent ?b1 - block ?l1 - location ?l2 - location)
    :precondition (and
      (moving-onblock-to-table ?a ?b1 ?l1 ?l2)
      (empty ?l2)
    )
    :effect (and
      (not (moving-onblock-to-table ?a ?b1 ?l1 ?l2))
      (ontable ?b1)
      (at ?b1 ?l2)
      (clear ?b1)
      (available ?a)
      (not (empty ?l2))
    )
  )

  (:action move-onblock-to-block-start
    ; b3 -> blocco su cui poggia b1
    :parameters (?a - agent ?b1 - block ?b2 - block ?b3 - block ?l1 - location ?l2 - location)
    :precondition (and
      (available ?a)
      (on ?b1 ?b3)
      (at ?b1 ?l1)
      (at ?b2 ?l2)
      (clear ?b2)
      (clear ?b1)

      (not (exists (?b - block) (moving-onblock-to-table ?a ?b ?l1 ?l2)))
      (not (exists (?b4 - block) (moving-onblock-to-block ?a ?b1 ?b4 ?l1 ?l2)))
      (not (exists (?b4 - block) (moving-onblock-to-block ?a ?b4 ?b2 ?l1 ?l2)))
      (not (exists (?b4 - block) (moving-table-to-table ?a ?b4 ?l1 ?l2)))
      (not (exists (?b4 - block ?b5 - block) (moving-table-to-block ?a ?b4 ?b5 ?l1 ?l2)))
    )
    :effect (and
      (not (available ?a))
      (not (clear ?b1))
      (not (on ?b1 ?b3))
      (not (at ?b1 ?l1))
      (moving-onblock-to-block ?a ?b1 ?b2 ?l1 ?l2)
      (clear ?b3)
    )
  )
  
  (:action move-onblock-to-block-end
    :parameters (?a - agent ?b1 - block ?b2 - block ?l1 - location ?l2 - location)
    :precondition (and
      (moving-onblock-to-block ?a ?b1 ?b2 ?l1 ?l2)
      (clear ?b2)
      (at ?b2 ?l2)
    )
    :effect (and
      (not (clear ?b2))
      (not (moving-onblock-to-block ?a ?b1 ?b2 ?l1 ?l2))
      (on ?b1 ?b2)
      (at ?b1 ?l2)
      (clear ?b1)
      (available ?a)
    )
  )

  (:action move-table-to-table-start
    :parameters (?a - agent ?b - block ?l1 - location ?l2 - location)
    :precondition (and 
      (ontable ?b)
      (at ?b ?l1) 
      (available ?a) 
      (clear ?b)
      (empty ?l2)

      (not (exists (?b2 - block) (moving-onblock-to-table ?a ?b2 ?l1 ?l2)))
      (not (exists (?b2 - block ?b3 - block) (moving-onblock-to-block ?a ?b2 ?b3 ?l1 ?l2)))
      (not (moving-table-to-table ?a ?b ?l1 ?l2))
      (not (exists (?b2 - block ?b3 - block) (moving-table-to-block ?a ?b2 ?b3 ?l1 ?l2)))
    )
    :effect (and 
      (not (available ?a))
      (not (clear ?b))
      (not (ontable ?b))
      (not (at ?b ?l1))
      (empty ?l1)
      (moving-table-to-table ?a ?b ?l1 ?l2)
    )
  )

  (:action move-table-to-table-end
    :parameters (?a - agent ?b - block ?l1 - location ?l2 - location)
    :precondition (and 
      (moving-table-to-table ?a ?b ?l1 ?l2)
      (empty ?l2)
    )
    :effect (and 
      (not (moving-table-to-table ?a ?b ?l1 ?l2))
      (ontable ?b)
      (at ?b ?l2)
      (not (empty ?l2))
      (clear ?b)
      (available ?a)
    )
  )

  (:action move-table-to-block-start
    :parameters (?a - agent ?b1 - block ?b2 - block ?l1 - location ?l2 - location)
    :precondition (and 
      (available ?a)
      (ontable ?b1)
      (at ?b1 ?l1) 
      (at ?b2 ?l2)
      (clear ?b2) 
      (clear ?b1)

      (not (exists (?b3 - block) (moving-onblock-to-table ?a ?b3 ?l1 ?l2)))
      (not (exists (?b3 - block ?b4 - block) (moving-onblock-to-block ?a ?b3 ?b4 ?l1 ?l2)))
      (not (exists (?b3 - block) (moving-table-to-table ?a ?b3 ?l1 ?l2)))
      (not (moving-table-to-block ?a ?b1 ?b2 ?l1 ?l2))
      (not (exists (?b3 - block) (moving-table-to-block ?a ?b3 ?b2 ?l1 ?l2)))
    )
    :effect (and 
      (not (available ?a))
      (not (clear ?b1))
      (not (ontable ?b1))
      (not (at ?b1 ?l1))
      (empty ?l1)
      (moving-table-to-block ?a ?b1 ?b2 ?l1 ?l2)
    )
  )

  (:action move-table-to-block-end
    :parameters (?a - agent ?b1 - block ?b2 - block ?l1 - location ?l2 - location)
    :precondition (and 
      (moving-table-to-block ?a ?b1 ?b2 ?l1 ?l2)
      (clear ?b2)
    )
    :effect (and 
      (not (clear ?b2))
      (not (moving-table-to-block ?a ?b1 ?b2 ?l1 ?l2))
      (on ?b1 ?b2)
      (at ?b1 ?l2)
      (clear ?b1)
      (available ?a)
    )
  )
)

; problem
(define (problem blocks-problem)
  (:domain blocks-world)
  
  (:objects
    b1 b2 b3 b4 b5 b6 - block
    a1 a2 - agent
    loc_1_1 loc_2_2 loc_3_3 loc_10_10 - location
  )
  
  (:init
    ; Block positions
    (ontable b1) (ontable b2) (ontable b3)
    (on b4 b1) (on b5 b2) (on b6 b3)
    
    ; Block locations
    (at b1 loc_1_1) (at b2 loc_2_2) (at b3 loc_3_3)
    (at b4 loc_1_1) (at b5 loc_2_2) (at b6 loc_3_3)
    
    ; Clear blocks (nothing on top)
    (clear b4) (clear b5) (clear b6)
    
    ; Available agents
    (available a1) (available a2)
    
    ; Empty locations
    (empty loc_10_10)
  )
  
  (:goal
    (and
      (ontable b1) (ontable b2)
      (ontable b3) (ontable b4)
      
      (on b5 b4) (on b6 b3)
      
      (at b1 loc_1_1) (at b2 loc_2_2) (at b3 loc_3_3)
      (at b4 loc_10_10) (at b5 loc_10_10) (at b6 loc_3_3)
      
      (clear b1) (clear b2)
      (clear b5) (clear b6)
      
      (available a1) (available a2)
    )
  )
)

; plan
1. (move-onblock-to-table-start a1 b4 b1 loc_1_1 loc_10_10)
   deleted: (available a1) (clear b4) (on b4 b1) (at b4 loc_1_1)
   added: (clear b1) (moving-onblock-to-table a1 b4 loc_1_1 loc_10_10)
   goals met: 12 of 18
2. (move-onblock-to-table-end a1 b4 loc_1_1 loc_10_10)
   deleted: (moving-onblock-to-table a1 b4 loc_1_1 loc_10_10) (empty loc_10_10)
   added: (ontable b4) (at b4 loc_10_10) (clear b4) (available a1)
   goals met: 15 of 18
3. (move-onblock-to-block-start a1 b5 b4 b2 loc_2_2 loc_10_10)
   deleted: (available a1) (clear b5) (on b5 b2) (at b5 loc_2_2)
   added: (moving-onblock-to-block a1 b5 b4 loc_2_2 loc_10_10) (clear b2)
   goals met: 14 of 18
4. (move-onblock-to-block-end a1 b5 b4 loc_2_2 loc_10_10)
   deleted: (clear b4) (moving-onblock-to-block a1 b5 b4 loc_2_2 loc_10_10)
   added: (on b5 b4) (at b5 loc_10_10) (clear b5) (available a1)
   goals met: 18 of 18
